//=============================================================================
//
// フェード処理 [fade.h]
// Author : 
//
//=============================================================================
#ifndef _FADE_H_
#define _FADE_H_


//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include"main.h"
#include"manager.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FADE_RATE 0.02

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPolygon;

//*****************************************************************************
// クラス
//*****************************************************************************
class CFade
{
public:
	// フェードの状態
	typedef enum
	{
		FADE_NONE = 0,	// 何もない状態
		FADE_IN,		// フェードイン処理
		FADE_OUT,	// フェードアウト処理
		FADE_MAX
	} FADE;
	CFade();
	~CFade();
	static CFade *Create(void);
	void SetFade(CManeger::MODE modeNext);
	FADE GetFade(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void Init(void);

	// メンバ変数
	FADE m_fade;					// フェード状態
	CManeger::MODE m_modeNext;	// 次の画面（モード）
	D3DXCOLOR m_colorFade;			// フェード色
	CPolygon *m_pPolygon;
};

#endif